Storeroom/fio/fio_disk/disk_bare/without_raid_cache/log/RAID0/log_39/sdg/fio_read_64k.log
test: (g=0): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=64
fio-3.1
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=15621: Mon Jul 23 18:55:04 2018
   read: IOPS=3251, BW=203MiB/s (213MB/s)(1024MiB/5039msec)
    slat (usec): min=5, max=148, avg=17.56, stdev= 7.11
    clat (usec): min=1169, max=37090, avg=19659.39, stdev=1286.72
     lat (usec): min=1187, max=37108, avg=19677.10, stdev=1287.19
    clat percentiles (usec):
     |  1.00th=[18744],  5.00th=[18744], 10.00th=[18744], 20.00th=[18744],
     | 30.00th=[19006], 40.00th=[19006], 50.00th=[19006], 60.00th=[19530],
     | 70.00th=[20317], 80.00th=[20317], 90.00th=[20841], 95.00th=[20841],
     | 99.00th=[23462], 99.50th=[24249], 99.90th=[32113], 99.95th=[34866],
     | 99.99th=[36963]
   bw (  KiB/s): min=198912, max=216832, per=99.97%, avg=208038.40, stdev=7446.29, samples=10
   iops        : min= 3108, max= 3388, avg=3250.60, stdev=116.35, samples=10
  lat (msec)   : 2=0.07%, 4=0.07%, 20=61.17%, 50=38.69%
  cpu          : usr=1.65%, sys=7.86%, ctx=16375, majf=0, minf=545
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=16384,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=203MiB/s (213MB/s), 203MiB/s-203MiB/s (213MB/s-213MB/s), io=1024MiB (1074MB), run=5039-5039msec

Disk stats (read/write):
  sdg: ios=15901/0, merge=0/0, ticks=312281/0, in_queue=312882, util=98.06%